blog/symmetric-space.tex
% Created 2017-08-01 Tue 02:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsthm}
\usepackage{tikz-cd}
\newtheorem{remark}{Remark}
\newtheorem{theorem}{Theorem}
\newtheorem{lemma}[theorem]{Lemma}
\newtheorem{corollary}{Corollary}[theorem]
\newtheorem{conjecture}[theorem]{Conjecture}
\newtheorem{proposition}{Proposition}[theorem]
\newtheorem{problem}{Problem}
\newtheorem{exampl}{Example}
\newtheorem{definition}{Definition}
\newtheorem{propdef}[definition]{Proposition-Definition}
\author{darknmt}
\date{\today}
\title{Symmetric spaces and Lie groups}
\hypersetup{
 pdfauthor={darknmt},
 pdftitle={Symmetric spaces and Lie groups},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Symmetric space}
\label{sec:orgf40c825}
By de Rham decomposition, we now focus more on the building blocks: Riemannian manifolds with irreducible
holonomy. The theory of Lie groups allows us to understand a block if it is \emph{symmetric}.


\begin{definition}
A Riemannian manifold \(M\) is called \uline{symmetric} if for every \(x\in M\), there exists an isometry
\(s_x\) of \(M\) such that \(x\) is an isolated fixed point and \(s_x^2=Id\).
\end{definition}


Let \(x\in M\) and \(v\in T_xM\), we note by \(\exp_x(v)\) the point of distance \(|v|\) in the geodesic
starting in \(x\) with velocity \(v/|v|\). We remark that any isometry \(s_x\) with \(s_x^2=Id\) and \(x\) as isolated fixed
point satisfies 
\begin{equation}
  \label{eq:sxreverse}
s_x(\exp_x(v)) = \exp_x(-v)
\end{equation}
In fact the eigenvalues of \(T_xs_x\) have to be \(1\) or \(-1\), but as \(x\) is an isolated fixed point
one has \(T_xs_x = -Id\). Then \(s_x\) as an isometry sends the geodesic starting at \(x\) with velocity
\(v\) to one starting at \(s_x(x)=x\) with velocity \((s_x)_* v = -v\) and we have \eqref{eq:sxreverse}.


Equation \eqref{eq:sxreverse} tells us that \(s_x\) is a reflection of center \(x\) on every geodesic
passing by \(x\). We can compose two reflections \(s_x,s_y\) to form a translation on the geodesic
connecting \(x\) and \(y\). This shows that a symmetric space is complete and the group of isometries
of the form \(s_x\circ s_y\) acts transitively on \(M\).

\begin{theorem}[Symmetric space]
\label{org5e40a8d} 
Let \(M\) be a symmetric Riemannian manifold then 
\begin{enumerate}
\item \(M\) is complete.
\item Fix \(x_0\in M\), let \(G\) be the group generated by the isometries of form \(s_x\circ s_y,\ x,y\in
   M\) and \(H\) is the subgroup containing elements of \(G\) that fix \(x_0\), then \(G\) is Lie subgroup of
\(Isom(M)\) connected by arc, \(H\) is a closed Lie subgroup of \(G\) and \(M\) is isometric to
\(G/H\). Moreover the holonomy group of \(M\) is \(H\).
\end{enumerate}
\end{theorem}

\begin{remark}
In general, for a Lie group \(G\) and a closed Lie subgroup \(H\), if \(G\) has a metric left-invariant by
\(G\) and right-invariant by \(H\) (i.e. the metric on \(\frak{g}\) is invariant by action of \(H\) by
adjoint) then 
\[ 
\frak{g} = \frak{h} \oplus^\perp \frak{m},\quad [\frak{h},\frak{m}]\subset \frak{m}
\] 
But if \(G/H\) is symmetric then one has the following extra information 
\[
[\frak{m},\frak{m}]\subset \frak{h} 
\] 
It turns out that this condition is quite strong and allowed E. Cartan to
classify all such pairs \((\frak{g},\frak{h})\).
\end{remark}

\section{Locally symmetric space}
\label{sec:org7980132}
The previous results can be extended to locally symmetric spaces.

\begin{propdef}
Let \(M\) is a Riemannian manifold, the followings are equivalent
\begin{enumerate}
\item For every \(x\in M\), there exists a neighborhood \(U\) of \(x\) and an isometry \(s_x:\
   U\longrightarrow U\) such that \(s_x^2=Id\) and \(x\) is the unique fixed point of \(s_x\).
\item The curvature tensor \(R\) satisfies
\end{enumerate}
\[
\nabla R = 0
\]
If they are satisfied, \(M\) is called  \uline{locally symmetric}.
\end{propdef}

\begin{theorem}[Locally symmetric space]
\label{orgec3332a}
Let \(M\) be a locally symmetric Riemannian manifold, then there exists a unique symmetric simply
connected Riemannian manifold \(N\) such that \(M\) and \(N\) are locally isometric, i.e. for every
\(x\in M\) and \(y\in N\), there exists neighborhoods \(U\) of \(x\) and \(V\) of \(y\) that are isometric.
\end{theorem}

As a result, the reduced holonomy of \(M\) is the same as the holonomy of \(N\).

\section{Annex: Group of isometries as Lie group}
\label{sec:orga93046c}
We explain in this annex some subtle details: how can a group of isometries be a manifold. We state, with
Montgomery-Zippin, \emph{Transformation groups} as reference, the following general result:

\begin{theorem}[faithful + locally compact $\implies$ Lie]
\label{orgef9ee0b}
Let \(G\) be a group acting faithfully on a connected manifold \(M\) of class \(C^k\) such that each
action is \(C^1\) and \(G\) is locally compact. Then \(G\) is a Lie group and the map \(G\times M\longrightarrow M\) is \(C^1\).
\end{theorem}

Note that we equip \uline{a group} of isometries with the \textbf{compact-open topology}, as \(M\) is locally
 compact and therefore second-countable (i.e. the topology admits a countable base), we see that a
 group of isometries is also second-countable. It suffices to prove the local compactness for \uline{the
 group} of (all) isometries as this property is inherited by its closed subgroup. The detail can be
 found in Kobayashi-Nomizu's \emph{Foundations of differential geometry} (Volume I, Theorem 4.7).

\begin{theorem}
\label{orgd361322}
Let \(M\) be a connected, locally-compact metric space and \(G\) be the group of isometries of
\(M\), then
\begin{enumerate}
\item \(G\) is locally compact.
\item \(G_a\) the subset of isometries fixing a point \(a\in M\) is compact.
\item If, in addition, \(M\) is compact then \(G\) is also compact.
\end{enumerate}
\end{theorem}
Emacs 25.2.1 (Org mode 9.0.5)
\end{document}